grevaillot/svd_tools/headers/STM32H7x5_CM4/sai1.h
/** @defgroup sai1_sai_bclrfr SAIBCLRFR Clear flag register
@{*/

/** SAI1_SAI_BCLRFR_CLFSDET Clear late frame synchronization detection flag. This bit is write only. Programming this bit to 1 clears the LFSDET flag in the SAI_xSR register. This bit is not used in AC97or SPDIF mode Reading this bit always returns the value 0. **/
#define SAI1_SAI_BCLRFR_CLFSDET		(1 << 6)
/** SAI1_SAI_BCLRFR_CAFSDET Clear anticipated frame synchronization detection flag. This bit is write only. Programming this bit to 1 clears the AFSDET flag in the SAI_xSR register. It is not used in AC97or SPDIF mode. Reading this bit always returns the value 0. **/
#define SAI1_SAI_BCLRFR_CAFSDET		(1 << 5)
/** SAI1_SAI_BCLRFR_CCNRDY Clear Codec not ready flag. This bit is write only. Programming this bit to 1 clears the CNRDY flag in the SAI_xSR register. This bit is used only when the AC97 audio protocol is selected in the SAI_xCR1 register. Reading this bit always returns the value 0. **/
#define SAI1_SAI_BCLRFR_CCNRDY		(1 << 4)
/** SAI1_SAI_BCLRFR_CWCKCFG Clear wrong clock configuration flag. This bit is write only. Programming this bit to 1 clears the WCKCFG flag in the SAI_xSR register. This bit is used only when the audio block is set as master (MODE[1] = 0) and NODIV = 0 in the SAI_xCR1 register. Reading this bit always returns the value 0. **/
#define SAI1_SAI_BCLRFR_CWCKCFG		(1 << 2)
/** SAI1_SAI_BCLRFR_CMUTEDET Mute detection flag. This bit is write only. Programming this bit to 1 clears the MUTEDET flag in the SAI_xSR register. Reading this bit always returns the value 0. **/
#define SAI1_SAI_BCLRFR_CMUTEDET		(1 << 1)
/** SAI1_SAI_BCLRFR_COVRUDR Clear overrun / underrun. This bit is write only. Programming this bit to 1 clears the OVRUDR flag in the SAI_xSR register. Reading this bit always returns the value 0. **/
#define SAI1_SAI_BCLRFR_COVRUDR		(1 << 0)

/**@}*/

/** @defgroup sai1_sai_bdr SAIBDR Data register
@{*/


#define SAI1_SAI_BDR_DATA_SHIFT		0
#define SAI1_SAI_BDR_DATA_MASK		0xffffffff
/** @defgroup sai1_sai_bdr_data DATA Data A write to this register loads the FIFO provided the FIFO is not full. A read from this register empties the FIFO if the FIFO is not empty.
@{*/
/**@}*/


/**@}*/

/** @defgroup sai1_sai_pdmcr SAIPDMCR PDM control register
@{*/

/** SAI1_SAI_PDMCR_CKEN4 Clock enable of bitstream clock number 4 **/
#define SAI1_SAI_PDMCR_CKEN4		(1 << 11)
/** SAI1_SAI_PDMCR_CKEN3 Clock enable of bitstream clock number 3 **/
#define SAI1_SAI_PDMCR_CKEN3		(1 << 10)
/** SAI1_SAI_PDMCR_CKEN2 Clock enable of bitstream clock number 2 **/
#define SAI1_SAI_PDMCR_CKEN2		(1 << 9)
/** SAI1_SAI_PDMCR_CKEN1 Clock enable of bitstream clock number 1 **/
#define SAI1_SAI_PDMCR_CKEN1		(1 << 8)

#define SAI1_SAI_PDMCR_MICNBR_SHIFT		4
#define SAI1_SAI_PDMCR_MICNBR_MASK		0x03
/** @defgroup sai1_sai_pdmcr_micnbr MICNBR Number of microphones
@{*/
/**@}*/

/** SAI1_SAI_PDMCR_PDMEN PDM enable **/
#define SAI1_SAI_PDMCR_PDMEN		(1 << 0)

/**@}*/

/** @defgroup sai1_sai_pdmdly SAIPDMDLY PDM delay register
@{*/


#define SAI1_SAI_PDMDLY_DLYM4R_SHIFT		28
#define SAI1_SAI_PDMDLY_DLYM4R_MASK		0x07
/** @defgroup sai1_sai_pdmdly_dlym4r DLYM4R Delay line for second microphone of pair 4
@{*/
/**@}*/


#define SAI1_SAI_PDMDLY_DLYM4L_SHIFT		24
#define SAI1_SAI_PDMDLY_DLYM4L_MASK		0x07
/** @defgroup sai1_sai_pdmdly_dlym4l DLYM4L Delay line for first microphone of pair 4
@{*/
/**@}*/


#define SAI1_SAI_PDMDLY_DLYM3R_SHIFT		20
#define SAI1_SAI_PDMDLY_DLYM3R_MASK		0x07
/** @defgroup sai1_sai_pdmdly_dlym3r DLYM3R Delay line for second microphone of pair 3
@{*/
/**@}*/


#define SAI1_SAI_PDMDLY_DLYM3L_SHIFT		16
#define SAI1_SAI_PDMDLY_DLYM3L_MASK		0x07
/** @defgroup sai1_sai_pdmdly_dlym3l DLYM3L Delay line for first microphone of pair 3
@{*/
/**@}*/


#define SAI1_SAI_PDMDLY_DLYM2R_SHIFT		12
#define SAI1_SAI_PDMDLY_DLYM2R_MASK		0x07
/** @defgroup sai1_sai_pdmdly_dlym2r DLYM2R Delay line for second microphone of pair 2
@{*/
/**@}*/


#define SAI1_SAI_PDMDLY_DLYM2L_SHIFT		8
#define SAI1_SAI_PDMDLY_DLYM2L_MASK		0x07
/** @defgroup sai1_sai_pdmdly_dlym2l DLYM2L Delay line for first microphone of pair 2
@{*/
/**@}*/


#define SAI1_SAI_PDMDLY_DLYM1R_SHIFT		4
#define SAI1_SAI_PDMDLY_DLYM1R_MASK		0x07
/** @defgroup sai1_sai_pdmdly_dlym1r DLYM1R Delay line adjust for second microphone of pair 1
@{*/
/**@}*/


#define SAI1_SAI_PDMDLY_DLYM1L_SHIFT		0
#define SAI1_SAI_PDMDLY_DLYM1L_MASK		0x07
/** @defgroup sai1_sai_pdmdly_dlym1l DLYM1L Delay line adjust for first microphone of pair 1
@{*/
/**@}*/


/**@}*/
